import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        arrayScanner(); //Вставить метод для вывода ответа в консоль
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Создайте метод printThreeWords(), который при вызове должен отпечатать
// в столбец три слова: Orange, Banana, Apple
    public static void printThreeWords() {
        System.out.println("Orange");
        System.out.println("Banana");
        System.out.println("Apple");
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Создайте метод checkSumSign(), в теле которого объявите две int переменные a и b,
// и инициализируйте их любыми значениями, которыми захотите.
// Далее метод должен просуммировать эти переменные, и если их сумма больше или равна 0,
// то вывести в консоль сообщение “Сумма положительная”,
// в противном случае - “Сумма отрицательная”;

    public static void checkSumSign() {
        int a = -5;
        int b = 10;

        int sum = a + b;

        if (sum >= 0) {
            System.out.println("Сумма положительная");
        } else {
            System.out.println("Сумма отрицательная");
        }
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Создайте метод printColor() в теле которого задайте int переменную value и
// инициализируйте ее любым значением. Если value меньше 0 (0 включительно),
// то в консоль метод должен вывести сообщение “Красный”, если лежит в пределах от 0
// (0 исключительно) до 100 (100 включительно), то “Желтый”, если больше 100 (100 исключительно) - “Зеленый”;

    public static void printColor() {
        int value = 1000;
        if (value <= 0) {
            System.out.println("Красный");
        }
        else if (value > 0 && value <= 100) {
            System.out.println("Желтый");
        }
        else {
            System.out.println("Зеленый");
        }
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Создайте метод compareNumbers(), в теле которого объявите две int переменные a и b, и инициализируйте
// их любыми значениями, которыми захотите. Если a больше или равно b, то необходимо вывести в консоль
// сообщение “a >= b”, в противном случае “a < b”;

    public static void compareNumbers() {
        int a = 15;
        int b = 10;
        if (a >= b) {
            System.out.println("a >= b");
        }
        else {
            System.out.println("a < b");
        }
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Напишите метод, принимающий на вход два целых числа и проверяющий, что их сумма лежит в пределах
// от 10 до 20 (включительно), если да – вернуть true, в противном случае – false.

    public static void checkSumInterval () {
        Scanner scannera = new Scanner(System.in);
        Scanner scannerb = new Scanner(System.in);
        int a = scannera.nextInt();
        int b = scannerb.nextInt();
        int sum = a + b;
        boolean isMore = sum > 10 && sum <= 20;
        System.out.println(isMore);
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Напишите метод, которому в качестве параметра передается целое число, метод должен напечатать в консоль,
//положительное ли число передали или отрицательное. Замечание: ноль считаем положительным числом.

    public static void positiveOrNegative () {
        Scanner scanner = new Scanner(System.in);
        int a = scanner.nextInt();
        if (a >= 0) {
            System.out.println("Число положительное");
        }
        else {
            System.out.println("Число отрицательное");
        }
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Напишите метод, которому в качестве параметра передается целое число. Метод должен вернуть true,
//если число отрицательное, и вернуть false если положительное.
//Замечание: ноль считаем положительным числом.

    public static void positiveOrNegativeBoolean () {
        Scanner scanner = new Scanner(System.in);
        int a = scanner.nextInt();
        boolean isMore = a <= 0;
        System.out.println(isMore);
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Напишите метод, которому в качестве аргументов передается строка и число, метод должен отпечатать
// в консоль указанную строку, указанное количество раз

    public static void stringMultipleTimes(String text, int times) {
        for (int i = 0; i < times; i++) {
            System.out.println(text);
        }
    }

/*    public static void main(String[] args) {
        printStringMultipleTimes("Привет!", 5);
    }*/  //При запуске данного задания необходимо раскомментировать строки 130-132 и закомментировать строки 4-6

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Напишите метод, который определяет, является ли год високосным, и возвращает boolean
//(високосный - true, не високосный - false). Каждый 4-й год является високосным,
//кроме каждого 100-го, при этом каждый 400-й – високосный.

    public static void leapYear () {
        Scanner scanner = new Scanner(System.in);
        int a = scanner.nextInt();
        boolean year = (a % 400 == 0) || (a % 4 == 0 && a % 100 != 0);
        System.out.println(year);
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Задать целочисленный массив, состоящий из элементов 0 и 1. Например: [ 1, 1, 0, 0, 1, 0, 1, 1, 0, 0 ].
// С помощью цикла и условия заменить 0 на 1, 1 на 0;

    public static void array () {
        int [] elements = {1, 1, 0, 0, 1, 0, 1, 1, 0, 0};
        for (int i = 0; i < elements.length; i++) {
            if (elements[i] == 0) {
                elements[i] = 1;
            }
            else {
                elements[i] = 0;
            }
            System.out.print(elements[i]);
        }
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Задать пустой целочисленный массив длиной 100. С помощью цикла заполнить его значениями 1 2 3 4 5 6 7 8 ... 100;

    public static void arrHundred () {
        int [] array = new int[100];
        for (int i = 0; i < array.length; i++) {
            array[i] = i+1;
        }
        for (int j = 0; j < array.length; j++) {
            System.out.print(array[j] + " ");
        }
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Задать массив [ 1, 5, 3, 2, 11, 4, 5, 2, 4, 8, 9, 1 ] пройти по нему циклом, и числа меньшие 6 умножить на 2;

    public static void operationsWithArrayElements () {
        int [] array = {1, 5, 3, 2, 11, 4, 5, 2, 4, 8, 9, 1};
        for (int i = 0; i < array.length; i++) {
            if (array[i] < 6) {
                array[i] = array[i] * 2;
            }
            System.out.print(array[i] + " ");
        }
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Создать квадратный двумерный целочисленный массив (количество строк и столбцов одинаковое), и с помощью цикла(-ов)
//заполнить его диагональные элементы единицами (можно только одну из диагоналей, если обе сложно). Определить элементы
//одной из диагоналей можно по следующему принципу: индексы таких элементов равны, то есть [0][0], [1][1], [2][2], ..., [n][n];

    public static void operationsDiagonal () {
        int k = 20;
        int [][] diagonal = new int [k][k];
        for (int i = 0; i < k; i++) {
            for (int j = 0; j < k; j++) {
                diagonal[i][i] = 1;
                diagonal[i][k - 1 - i] = 1;
                System.out.print(diagonal[i][j] + " ");
            }
            System.out.println();
        }
    }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Написать метод, принимающий на вход два аргумента: len и initialValue, и возвращающий одномерный массив типа
// int длиной len, каждая ячейка которого равна initialValue.

    public static void arrayScanner () {
        Scanner scanner = new Scanner(System.in);
        int len = scanner.nextInt();
        int initialValue = scanner.nextInt();
        int[] array = new int[len];
        for (int i = 0; i < len; i++) {
            array[i] = initialValue;
            System.out.print(array[i]);
            if (i < array.length - 1) {
                System.out.print(", ");
            }
        }
    }
}
